src/cf/База2/Documents/ПотребностьВТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПотребностьВТМЦ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователь</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наличие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обеспечено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/База2/AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/База2/Documents/ПеремещениеСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПеремещениеСоСклада</Name>
			<BasedOn>
				<xr:Item>Document.ПотребностьВТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСкладе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПотребностьВТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/База2/Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<BasedOn>
				<xr:Item>Document.ПотребностьВТМЦ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПотребностьВТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/База2/Documents/ПотребностьВТМЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПроверитьНаличиеНаСервере()
	Для каждого строка из Объект.СписокТМЦ Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОстаткиНаСкладеОстатки.Номенклатура КАК Номенклатура,
		               |	ОстаткиНаСкладеОстатки.Склад КАК Склад,
		               |	ОстаткиНаСкладеОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ОстаткиНаСкладе.Остатки(&Дата, ) КАК ОстаткиНаСкладеОстатки
		               |ГДЕ
		               |	ОстаткиНаСкладеОстатки.Номенклатура = &Номенклатура
		               |	И ОстаткиНаСкладеОстатки.Склад <> &Склад";
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Если Строка.Количество < Результат.КоличествоОстаток Тогда
				Строка.Наличие    = Строка.КОличество; 
				Строка.Склад      = Результат.Склад;
			Иначе
				Строка.Наличие = Результат.КоличествоОстаток; 
				Строка.Склад      = Результат.Склад;
			КонецЕсли;
		КонецЕслИ;
	КонецЦикла;  
	Объект.Статус = Перечисления.СтатусыЗаявки.НаИсполнении;  
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличие(Команда)
	ПроверитьНаличиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере()
	СоздатьДокументыПеремещения();
	СоздатьДОкументыЗаказПоставщику();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПеремещения() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка КАК Ссылка,
	|	ПотребностьВТМЦСписокТМЦ.НомерСтроки КАК НомерСтроки,
	|	ПотребностьВТМЦСписокТМЦ.Номенклатура КАК Номенклатура,
	|	ПотребностьВТМЦСписокТМЦ.Количество КАК Количество,
	|	ПотребностьВТМЦСписокТМЦ.Наличие КАК Наличие,
	|	ПотребностьВТМЦСписокТМЦ.Обеспечено КАК Обеспечено,
	|	ПотребностьВТМЦСписокТМЦ.Склад КАК Склад
	|ИЗ
	|	Документ.ПотребностьВТМЦ.СписокТМЦ КАК ПотребностьВТМЦСписокТМЦ
	|ГДЕ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка = &Ссылка
	|	И ПотребностьВТМЦСписокТМЦ.Количество <> ПотребностьВТМЦСписокТМЦ.Наличие";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()= 0 тогда
		ДокПеремещения = Документы.ПеремещениеСоСклада.СоздатьДокумент(); 
		ДокПеремещения.Дата = ТекущаяДата();
		ДокПеремещения.СкладПолучатель = Объект.Склад;
		ДокПеремещения.ДокументОснование = Объект.Ссылка;
		Для каждого строка из Объект.СписокТМЦ цикл
			ДокПеремещения.СкладОтправитель = Строка.Склад;
			НоваяСтрока = ДокПеремещения.СписокТМЦ.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Количество   = Строка.Количество;
			Строка.Обеспечено = Истина;
		КонецЦикла;  
		ДокПеремещения.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ перемещения со склада " + ДокПеремещения.Ссылка);    
		Объект.Статус = перечисления.СтатусыЗаявки.ГотовКПолучению;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьДОкументыЗаказПоставщику() 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка КАК Ссылка,
	|	ПотребностьВТМЦСписокТМЦ.НомерСтроки КАК НомерСтроки,
	|	ПотребностьВТМЦСписокТМЦ.Номенклатура КАК Номенклатура,
	|	ПотребностьВТМЦСписокТМЦ.Количество КАК Количество,
	|	ПотребностьВТМЦСписокТМЦ.Наличие КАК Наличие,
	|	ПотребностьВТМЦСписокТМЦ.Обеспечено КАК Обеспечено
	|ИЗ
	|	Документ.ПотребностьВТМЦ.СписокТМЦ КАК ПотребностьВТМЦСписокТМЦ
	|ГДЕ
	|	ПотребностьВТМЦСписокТМЦ.Ссылка = &Ссылка
	|	И ПотребностьВТМЦСписокТМЦ.Количество <> ПотребностьВТМЦСписокТМЦ.Наличие";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество()> 0 тогда
		ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент(); 
		ЗаказПоставщику.Дата = ТекущаяДата();
		ЗаказПоставщику.Склад = Объект.Склад;
		ЗаказПоставщику.Организация = Объект.Организация;
		ЗаказПоставщику.ЖелаемаяДата = Объект.ЖелаемаяДата;
		ЗаказПоставщику.ДокументОснование = Объект.Ссылка;
		Для каждого строка из Результат цикл
			НоваяСтрока = ЗаказПоставщику.СписокТМЦ.Добавить();
			НоваяСтрока.Номенклатура = Строка.Номенклатура;
			НоваяСтрока.Количество   = Строка.Количество - Строка.Наличие;
		КонецЦикла;  
		ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ заказ поставщику " + ЗаказПоставщику.Ссылка);
	КонецЕсли;
КонецПроцедуры
